#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/GithubActionsORG/ci-cd-staging/runs/run-iomy3jKGKD5D945K

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo will be created
  + resource "aws_instance" "staging_cicd_demo" {
      + ami                                  = "ami-0ef0975ebdd78b77b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0878895fddd50495b",
        ]

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.staging_cicd_demo_PR_19 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_19" {
      + ami                                  = "ami-0ef0975ebdd78b77b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_19"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_19"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0878895fddd50495b",
        ]

      + capacity_reservation_specification (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + root_block_device (known after apply)
    }

  # aws_key_pair.staging_key will be created
  + resource "aws_key_pair" "staging_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDG3wkESTPtwnhGAB1oC8mTMsbILmjozuGvQap/+oWLbpP6pFVv6H0N7ybhYRMBikZUvnA6n1ALkLp/0W8FwnKaxLP1UBiHqrUFbTEd1U9NgvS8Kdijl7/RXl6Vs+RSrFqQf/XdU0pvJL6CnkJHNxuKouGW9MxjkcLzoP/B7Yz57qK8/y/9tu0P8c+Kg7/YYUscYyXyoPW157YYF+lH5MhPO8vu/syz1m/zwY+sAtXq1ZQHSAOe5L7bZFUXxBlkC4adCvrvcKH7bw/KmRKIlW11seBg5Zeyk/KEYhD2wQHw7Ek02ztEWXBcxH0+Vesog8mLXt5AiDQdnrV0cqtczycTdDcX0evMruCOMdP50cJme+q+2IdJkgl5Lxa/uz5SZdGmwBN2rfdodGRIOp0TA5OW32l6mxXodRi98JFfBkxVyk2/NomBLTVOYZHndmae26vQUB1Z0Ij0a4YZxVRcPjYRgVcYEWjelZrFnMDrr98MaS0XDBhbN7WoRJQKzjV3HrY/dZBg4f/GXsaMet+6y4DrabbNbnjKL9WDoAT+GNQt2UMwYToH1vXFyWeykX+xUgZGEFdq0+Z2+lPqZNVScdCO4U6m6B+NvWEpxMqJBZcqhVY8z7omE5vq/KTwtAQ8ByS1pP6MAqle2GtUxD4oUR32UAPP1yxoKQ67/G546slv+Q== ssh-key"
      + tags            = {
          + "Name" = "staging_public_key"
        }
      + tags_all        = {
          + "Name" = "staging_public_key"
        }
    }

  # random_id.server will be created
  + resource "random_id" "server" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-0ef0975ebdd78b77b"
        }
    }

  # random_id.server_PR_19 will be created
  + resource "random_id" "server_PR_19" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-0ef0975ebdd78b77b"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + staging_dns       = (known after apply)
  + staging_dns_PR_19 = (known after apply)

```

</details>

*Pusher: @Rafael-Ya, Action: `workflow_dispatch`*